Frontend/ES6+.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-22 周五 01:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>_ES6+</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">_ES6+</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9485c4c">1. ES6 语法</a>
<ul>
<li><a href="#orgc46d8bc">1.1. let/const/var</a></li>
<li><a href="#org95c693a">1.2. 模板字符串</a></li>
<li><a href="#org4f465c7">1.3. 箭头函数</a></li>
<li><a href="#orgc0ad291">1.4. 结构化赋值</a></li>
</ul>
</li>
<li><a href="#org1068df7">2. 模块</a>
<ul>
<li><a href="#org5de0905">2.1. CommonJS 规范</a></li>
<li><a href="#org9f1ba7f">2.2. AMD 规范</a></li>
<li><a href="#org17c0f87">2.3. 其他规范</a>
<ul>
<li><a href="#orgcdcb5fe">2.3.1. UMD规范</a></li>
<li><a href="#org87a7480">2.3.2. CMD 规范</a></li>
</ul>
</li>
<li><a href="#org072436b">2.4. es6 Module</a></li>
</ul>
</li>
<li><a href="#org6e56a84">3. 前端工程化</a>
<ul>
<li><a href="#orga72f818">3.1. babel</a></li>
<li><a href="#org6614fa7">3.2. npm/yarn</a></li>
<li><a href="#org3e737eb">3.3. Webpack</a></li>
<li><a href="#org8f7c16b">3.4. 其他的脚手架</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-org9485c4c" class="outline-2">
<h2 id="org9485c4c"><span class="section-number-2">1</span> ES6 语法</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc46d8bc" class="outline-3">
<h3 id="orgc46d8bc"><span class="section-number-3">1.1</span> let/const/var</h3>
<div class="outline-text-3" id="text-1-1">
<p>
const 定义的变量，是不能够重新赋值的。
所以这个是使用优先级最高的个语法，他能极大保障数据的安全性。
</p>

<p>
let 跟 const 是一样的，只不过它可以重新被赋值。
</p>

<p>
let 跟 const 是块级作用域，但是 var 是函数级作用域。
</p>

<div class="org-src-container">
<pre class="src src-js">{
    <span class="org-keyword">var</span> <span class="org-variable-name">x</span> = 333;
    <span class="org-keyword">let</span> <span class="org-variable-name">y</span> = 444;
}

console.log(x); <span class="org-comment-delimiter">// </span><span class="org-comment">333</span>
console.log(y); <span class="org-comment-delimiter">// </span><span class="org-comment">&#25253;&#38169;</span>

<span class="org-keyword">function</span> <span class="org-function-name">aaa</span> () {
    console.log(<span class="org-string">"pre"</span>, x);  <span class="org-comment-delimiter">// </span><span class="org-comment">undefined</span>
    <span class="org-keyword">if</span> (<span class="org-constant">true</span>) {
        <span class="org-keyword">var</span> <span class="org-variable-name">x</span> = 323;
    }
    console.log(<span class="org-string">"post"</span>, x); <span class="org-comment-delimiter">// </span><span class="org-comment">323&#65292;&#35760;&#20303;&#65292;var &#23450;&#20041;&#30340;&#21464;&#37327;&#26159;&#20989;&#25968;&#32423;&#21035;&#30340;&#20316;&#29992;&#22495;&#30340;</span>
}
</pre>
</div>

<p>
for..var / for..let:
</p>
<div class="org-src-container">
<pre class="src src-js">
<span class="org-comment-delimiter">// </span><span class="org-comment">1. &#24322;&#27493;&#20219;&#21153;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2. &#38381;&#21253;&#65292;&#35789;&#27861;&#20316;&#29992;&#22495;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">3. var/let &#21306;&#21035;</span>

<span class="org-keyword">for</span> (<span class="org-keyword">var</span> <span class="org-variable-name">i</span>=0; i&lt;10; i++) {
    setTimeout(<span class="org-keyword">function</span>() {
        console.log(i);
    }, 0);
}
<span class="org-comment-delimiter">// </span><span class="org-comment">10 &#20010; 10</span>

<span class="org-keyword">for</span> (<span class="org-keyword">let</span> <span class="org-variable-name">i</span>=0; i&lt;10; i++) {
    setTimeout(<span class="org-keyword">function</span>() {
        console.log(i);
    }, 0);
}
<span class="org-comment-delimiter">// </span><span class="org-comment">0....9</span>


<span class="org-keyword">for</span> (<span class="org-keyword">var</span> <span class="org-variable-name">i</span>=0; i&lt;10; i++) {
    (<span class="org-keyword">function</span> () {
        <span class="org-keyword">var</span> <span class="org-variable-name">j</span> = i;
        setTimeout(<span class="org-keyword">function</span>() {
            console.log(j);
        }, 0)
    })();
}
<span class="org-comment-delimiter">// </span><span class="org-comment">&#25163;&#21160;&#23454;&#29616;&#37325;&#26032;&#32465;&#23450;&#65292;&#36755;&#20986;&#20063;&#26159; 0...9</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org95c693a" class="outline-3">
<h3 id="org95c693a"><span class="section-number-3">1.2</span> 模板字符串</h3>
<div class="outline-text-3" id="text-1-2">
<p>
字符串的写法，现在有三种:
</p>
<div class="org-src-container">
<pre class="src src-js"> <span class="org-keyword">const</span> <span class="org-variable-name">aaa</span> = <span class="org-string">'hello,world'</span>
 <span class="org-keyword">const</span> <span class="org-variable-name">bbb</span> = <span class="org-string">"hello,world"</span>

 <span class="org-keyword">const</span> <span class="org-variable-name">ccc</span> = <span class="org-string">`hello,${aaa}`</span>
 <span class="org-keyword">const</span> <span class="org-variable-name">ddd</span> = <span class="org-string">`</span>
<span class="org-string">    hello, ${ccc.length}</span>
<span class="org-string">`</span>
</pre>
</div>

<p>
模板字符串，可以嵌入变量，使用 ${} 占位符。
</p>

<p>
可以换行。
</p>
</div>
</div>

<div id="outline-container-org4f465c7" class="outline-3">
<h3 id="org4f465c7"><span class="section-number-3">1.3</span> 箭头函数</h3>
<div class="outline-text-3" id="text-1-3">
<p>
短而易用。
</p>

<p>
<b>在箭头函数内部，没有自己的 this 指针，它使用的 this 是来自父元素的。</b>
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">id</span> = 666;

<span class="org-keyword">var</span> <span class="org-variable-name">ooo</span> = {
    id: 3333,
    xxx: () =&gt; {
        console.log(<span class="org-string">'id:'</span>, <span class="org-constant">this</span>.id); <span class="org-comment-delimiter">// </span><span class="org-comment">666</span>
    }
}


<span class="org-comment-delimiter">// </span><span class="org-comment">example 2.</span>
<span class="org-keyword">function</span> <span class="org-function-name">Person</span> () {
    <span class="org-constant">this</span>.age = 20;
    <span class="org-constant">this</span>.tell = () =&gt; { <span class="org-comment-delimiter">// </span><span class="org-comment">&#25913;&#25104; function &#26041;&#24335;&#65292;&#20250;&#20986;&#38169;&#65292;&#20026;&#20160;&#20040;</span>
        console.log(<span class="org-constant">this</span>.age);
    }
}

<span class="org-keyword">var</span> <span class="org-variable-name">p</span> = <span class="org-keyword">new</span> <span class="org-type">Person</span>();
setTimeout(p.tell, 0);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0ad291" class="outline-3">
<h3 id="orgc0ad291"><span class="section-number-3">1.4</span> 结构化赋值</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">arr</span> = [22, 33, 445, 6667];

<span class="org-comment-delimiter">/* </span><span class="org-comment">var a = arr[0];</span>
<span class="org-comment"> * var b = arr[1];</span>
<span class="org-comment"> * var c = arr[2];</span>
<span class="org-comment"> */</span>

<span class="org-keyword">const</span> [ <span class="org-variable-name">a</span>, <span class="org-variable-name">b</span>, <span class="org-variable-name">_</span>, <span class="org-variable-name">d</span> ] = arr;
<span class="org-keyword">const</span> [ aa, bb, ...cc ] = arr;
console.log(aa, bb, cc);

<span class="org-keyword">const</span> { e, f } = { e: 333, f: 444, g: 555 };

<span class="org-comment-delimiter">// </span><span class="org-comment">import { Button, Form } from './ksjfdksjd.js'</span>


<span class="org-keyword">const</span> <span class="org-variable-name">a1</span> = [<span class="org-string">'hello'</span>, <span class="org-string">'world'</span>];
<span class="org-keyword">const</span> <span class="org-variable-name">a2</span> = [2, 3, 4, 5];

<span class="org-keyword">const</span> <span class="org-variable-name">a3</span> = a1 + a2;
<span class="org-keyword">const</span> <span class="org-variable-name">a4</span> = [...a1, 39393939, 444, ...a2];
console.log(a4);


<span class="org-comment-delimiter">// </span><span class="org-comment">&#32467;&#26500;&#21270;&#20989;&#25968;&#21442;&#25968;</span>
<span class="org-keyword">function</span> <span class="org-function-name">tell</span>(<span class="org-variable-name">name</span>, <span class="org-variable-name">age</span>) {
    console.log(name, age);
}

<span class="org-keyword">var</span> <span class="org-variable-name">aaa</span> = [<span class="org-string">'tom'</span>, 333];
tell(...aaa);
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-org1068df7" class="outline-2">
<h2 id="org1068df7"><span class="section-number-2">2</span> 模块</h2>
<div class="outline-text-2" id="text-2">
<p>
JS 是一门仓促产生的语言，
在产生的时候，很多特性都不具备。
</p>

<p>
比如说，模块、命名空间。
</p>

<p>
这样就导致了很多问题。
</p>

<p>
所以，就产生了很多的第三方实现。
</p>
</div>

<div id="outline-container-org5de0905" class="outline-3">
<h3 id="org5de0905"><span class="section-number-3">2.1</span> CommonJS 规范</h3>
<div class="outline-text-3" id="text-2-1">
<p>
两个主要 api:
</p>
<ul class="org-ul">
<li>module.exports = {}</li>
<li>require('xxx')</li>
</ul>
</div>
</div>

<div id="outline-container-org9f1ba7f" class="outline-3">
<h3 id="org9f1ba7f"><span class="section-number-3">2.2</span> AMD 规范</h3>
<div class="outline-text-3" id="text-2-2">
<p>
requirejs 是他的一个主要实现。
</p>
</div>
</div>

<div id="outline-container-org17c0f87" class="outline-3">
<h3 id="org17c0f87"><span class="section-number-3">2.3</span> 其他规范</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgcdcb5fe" class="outline-4">
<h4 id="orgcdcb5fe"><span class="section-number-4">2.3.1</span> UMD规范</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
语法丑陋，但是兼容了 CommonJS 和 AMD
</p>
</div>
</div>

<div id="outline-container-org87a7480" class="outline-4">
<h4 id="org87a7480"><span class="section-number-4">2.3.2</span> CMD 规范</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
是中国人搞的
</p>
</div>
</div>
</div>

<div id="outline-container-org072436b" class="outline-3">
<h3 id="org072436b"><span class="section-number-3">2.4</span> es6 Module</h3>
<div class="outline-text-3" id="text-2-4">
<p>
经过了漫长的岁月，终于，在 es6 中出现了语言级别的
模块概念。
</p>

<p>
它有两个基本 api:
</p>
<ul class="org-ul">
<li>export</li>
<li>import x from 'xxx'</li>
</ul>

<p>
语法示例如下:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-comment-delimiter">// </span><span class="org-comment">&#30053;</span>
</pre>
</div>
</div>
</div>
</section>


<section id="outline-container-org6e56a84" class="outline-2">
<h2 id="org6e56a84"><span class="section-number-2">3</span> 前端工程化</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga72f818" class="outline-3">
<h3 id="orga72f818"><span class="section-number-3">3.1</span> babel</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://babeljs.io/">https://babeljs.io/</a>
</p>

<p>
这是一个翻译工具。
我们使用 es6/es7 等新的语法编程，
经过 babel 的翻译之后，它就能兼容不支持 es6/7 的浏览器。
</p>

<p>
它能把使用 es6/es7 等语法的文件，
根据配置翻译成能够在指定浏览器使用的文件。
</p>

<p>
比如说，你可以指定，让它翻译成能够在 ie6 下面使用的使用。
</p>

<p>
你可以指定，让它翻译成能够兼容 ie8 的文件。
</p>

<p>
你也可以指定，让它翻译成能够兼容 ie10 的文件。
</p>
</div>
</div>

<div id="outline-container-org6614fa7" class="outline-3">
<h3 id="org6614fa7"><span class="section-number-3">3.2</span> npm/yarn</h3>
<div class="outline-text-3" id="text-3-2">
<p>
包的管理工具
</p>

<ul class="org-ul">
<li><a href="https://www.npmjs.com/">https://www.npmjs.com/</a></li>
<li><a href="https://www.npmjs.com.cn/">https://www.npmjs.com.cn/</a></li>
</ul>

<p>
下载插件，下载工具，简单的任务管理。
</p>

<p>
npm(nodejs package manager)，它是伴随 nodejs 出现的一个工具包。
</p>

<p>
使用相当简单。
</p>

<p>
第一步，下载。
</p>

<p>
第二步，安装。
</p>

<p>
第三步，使用。
</p>

<p>
基本命令如下:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">&#28155;&#21152;&#22269;&#20869;&#28304;</span>
npm config list
npm config set <span class="org-variable-name">registry</span>=https://registry.npm.taobao.org

<span class="org-comment-delimiter"># </span><span class="org-comment">&#21021;&#22987;&#21270;&#19968;&#20010;&#39033;&#30446;&#65292;&#22312;&#39033;&#30446;&#19979;&#38754;&#21019;&#24314;&#22522;&#26412;&#30340;&#37197;&#32622;&#25991;&#20214; package.json</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">package.json &#26159;&#23646;&#20110; CommonJS &#35268;&#33539;&#30340;&#19968;&#20010;&#37197;&#32622;&#25991;&#20214;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#22240;&#20026; npm &#20351;&#29992;&#30340;&#26159; CommonJS &#35268;&#33539;&#65292;&#25152;&#20197;&#65292;&#20182;&#20063;&#20351;&#29992;&#20102;&#21516;&#26679;&#30340; package.json &#20316;&#20026;&#23427;&#30340;&#37197;&#32622;&#25991;&#20214;</span>
npm init

<span class="org-comment-delimiter"># </span><span class="org-comment">&#19979;&#36733;&#19968;&#20010;&#25554;&#20214;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#19979;&#36733;&#23436;&#20043;&#21518;&#65292;&#40664;&#35748;&#20250;&#23433;&#35013;&#21040;&#24403;&#21069;&#30446;&#24405;&#19979;&#30340; node_moduels &#25991;&#20214;&#22841;&#37324;</span>
npm install jquery
npm install electron --global
npm install vue

<span class="org-comment-delimiter"># </span><span class="org-comment">&#21024;&#38500;&#25481;</span>
npm uninstall jquery

<span class="org-comment-delimiter"># </span><span class="org-comment">&#36816;&#34892;&#31616;&#21333;&#21629;&#20196;</span>
npm run hahaha
<span class="org-comment-delimiter"># </span><span class="org-comment">"scripts": {</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">"hahaha": "ipconfig",</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">"test": "echo \"Error: no test specified\" &amp;&amp; exit 1"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">},</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e737eb" class="outline-3">
<h3 id="org3e737eb"><span class="section-number-3">3.3</span> Webpack</h3>
<div class="outline-text-3" id="text-3-3">
<p>
用来:
</p>
<ol class="org-ol">
<li>打包资源</li>
<li>通过一定的插件，进行任务的集成（自动化任务）</li>
</ol>
</div>
</div>

<div id="outline-container-org8f7c16b" class="outline-3">
<h3 id="org8f7c16b"><span class="section-number-3">3.4</span> 其他的脚手架</h3>
<div class="outline-text-3" id="text-3-4">
<p>
cli: command line interface，命令行工具
</p>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-22 周五 01:23</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
